# # # # # # # # # # # # # # # # # # # # # # # # # Занятие 1-ое:# # # # # # # # # # # # # # # # # # # # # # # # # # # #
# # # 1 (изи)
# vvod_1 = int(input())
# vvod_2 = int(input())
# vvod_3 = int(input())
# print(vvod_1 + vvod_2 + vvod_3)
# ---------------------------------------------------------------------------------------------------------------------
# # # 2 (треугольник)
# treugle_1 = int(input())
# treugle_2 = int(input())
# treugle_s = (treugle_1 * treugle_2) * 0.5
# print(treugle_s)
# ---------------------------------------------------------------------------------------------------------------------
# # # 3 (яблоки)
# yabloki = int(input())
# sholniki = int(input())
# print(f'Каждоиу школьнику достанется \033[35m{yabloki // sholniki}\033[0m яблок')
# print(f'В карзине останется \033[33m{yabloki % sholniki}\033[0m яблок')
# ---------------------------------------------------------------------------------------------------------------------
# # # 4 (часики)
# vvod_minuts = int(input())
# hours = vvod_minuts % (60 * 24) // 60
# minuts = vvod_minuts % 60
# print(f'{hours}' ':' f'{minuts}')
# ---------------------------------------------------------------------------------------------------------------------
# # # 5 (изи)
# print('Enter your name')
# print(f'Hello, \033[35m{input()}')
# ---------------------------------------------------------------------------------------------------------------------
# # # 6 (следующее число-предыдущее)
# tvoe_chislo = int(input())
# print(f'\033[34mСледующее\033[0m число для твоего числа \033[35m{tvoe_chislo}\033[0m это \033[34m{tvoe_chislo + 1}')
# print(f'\033[31mПредыдущее\033[0m число для твоего числа \033[35m{tvoe_chislo}\033[0m это \033[31m{tvoe_chislo - 1}')
# ---------------------------------------------------------------------------------------------------------------------
# # # 7 (парты)
# print('Введите сколько учеников в каждом из трех классов')
# klass_1 = int(input())
# klass_2 = int(input())
# klass_3 = int(input())
# parti = (klass_1 + klass_2 + klass_3)
# polovinka = parti % 2
# if polovinka == 1:
#     print(f'На 3 класса учеников необходимо {(parti + 1) / 2} парт')
# else:
#     print(f'На 3 класса учеников необходимо {parti / 2} парт')
# ---------------------------------------------------------------------------------------------------------------------
# # # 8 (шнурки) (не получилось)
# print('Ведите расстояние между рядами дырочек для шнурков')
# rows = int(input())
# print('Введите расстояние между дырочками')
# foramens = int(input())
# print('Введите длинну свободного конца шнурка')
# pestik = int(input())
# print('Введите количество дырочек в ряду')
# how_many_foramens = int(input())
# if how_many_foramens == 1:
#     print(f'Длина шнурка должна быть таковой \033[35m\033[3m\033[4m{rows + (pestik * 2)}')
# else:
#     dlina_shkyri = how_many_foramens * ((foramens + rows) * 2) + (pestik * 2) + rows
#     print(f'Длина шнурка должна быть таковой \033[31m\033[3m\033[4m{dlina_shkyri}')
# -------                -------                -------                -------                -------                --
# # # 8 (шнурки2) (понять почему получилось тут)
# a = int(input())
# b = int(input())
# L = int(input())
# N = int(input())
# print(2 * L + (2 * N - 1) * a + 2 * (N - 1) * b)
# ---------------------------------------------------------------------------------------------------------------------
# # # # # # # # # # # # # # # # # # # # # # # # # Занятие 2-ое:# # # # # # # # # # # # # # # # # # # # # # # # # # # #
# # # 2.1 (два стула)
# num_1 = int(input())
# num_2 = int(input())
# if num_1 > num_2:
#     print(f'Первое число больше!! -> \033[35m\033[3m{num_1}\033[0m <-')
# else:
#     print(f'Второе число больше!! -> \033[34m\033[3m{num_2}\033[0m <-')
# ---------------------------------------------------------------------------------------------------------------------
# # # 2.2
# x = int(input())
# if x == 0:
#     print('\033[35m\033[3m\033[4m\033[1m0')
# else:
#     if x > 0:
#         print('\033[34m\033[3m\033[4m\033[1m1')
#     else:
#         print('\033[33m\033[3m\033[4m\033[1m-1')
# ---------------------------------------------------------------------------------------------------------------------
# # # 2.3 (шахматная доска)
# stolb_1 = int(input()) % 2
# stroka_1 = int(input()) % 2
# stolb_2 = int(input()) % 2
# stroka_2 = int(input()) % 2
# if stolb_1 == stroka_1:
#     if stolb_2 == stroka_2:
#         print('\033[1m\033[4m\033[32mYes\033[0m, цвет один. И он \033[40m\033[37m\033[1mЧерый!\033[0m')
#     else:
#         print('\033[1m\033[4m\033[31mNo\033[0m. Цвета разные. Первый \033[40m\033[37m\033[1mЧерный\033[0m, '
#               'второй \033[47m\033[30m\033[1mБелый\033[0m')
# else:
#     if stolb_2 != stroka_2:
#         print('\033[1m\033[4m\033[32mYes\033[0m, цвет один. И он \033[47m\033[30m\033[1mБелый!!\033[0m')
#     else:
#         print('\033[1m\033[4m\033[31mNo\033[0m. Цвета разные. Первый \033[47m\033[30m\033[1mБелый\033[0m, '
#               'второй \033[40m\033[37m\033[1mЧерный\033[0m')
# ---------------------------------------------------------------------------------------------------------------------
# # # 2.4 (Високосный год)
# vvod_god = int(input())
# if (vvod_god % 100) == 0:
#     if (vvod_god % 400) == 0:
#         print('YES!')
#     else:
#         print('NO!')
# else:
#     if (vvod_god % 4) == 0:
#         print('YES!!')
#     else:
#         print('NO!!')
# ---------------------------------------------------------------------------------------------------------------------
# # # 2.5 (наименьшее число)
# number_1 = int(input())
# number_2 = int(input())
# number_3 = int(input())
# if number_1 <= number_2 and number_1 <= number_3:
#     print(f'Наименьшее число ->{number_1}<-')
# elif number_2 <= number_1 and number_2 <= number_3:
#     print(f'Наименьшее число ->{number_2}<-')
# elif number_3 <= number_1 and number_3 <= number_2:
#     print(f'Наименьшее число ->{number_3}<-')
# ---------------------------------------------------------------------------------------------------------------------
# # # 2.6 (сколько совпадают чисел)
# vvod_4isel_1 = int(input())
# vvod_4isel_2 = int(input())
# vvod_4isel_3 = int(input())
# if vvod_4isel_1 == vvod_4isel_2 == vvod_4isel_3:
#     print(3)
# else:
#     if vvod_4isel_1 == vvod_4isel_2 or vvod_4isel_1 == vvod_4isel_3 or vvod_4isel_2 == vvod_4isel_3:
#         print(2)
#     else:
#         print(0)
# ---------------------------------------------------------------------------------------------------------------------
# # # 2.7 (ход ладьи)
# stolb_1 = int(input()) in range(1, 9)
# stroka_1 = int(input()) in range(1, 9)
# stolb_2 = int(input()) in range(1, 9)
# stroka_2 = int(input()) in range(1, 9)
# if stolb_1 and stolb_2 and stroka_1 and stroka_2 in range(1, 9):
#     if stolb_1 == stolb_2 and stroka_1 != stroka_2:
#         print('Yes. Прямой ход по вертикали')
#     else:
#         if stroka_1 == stroka_2 and stolb_1 != stolb_2:
#             print('Yes! Ход по горизонтали!')
#         else:
#             if stroka_1 == stroka_2 == stolb_1 == stolb_2:
#                 print('Вы уже находитесь в точке назначения')
#             else:
#                 print('No. Попасть с первой на вторую клетку одним ходом нельзя')
# else:
#     print('\033[31m\033[4mДопустимый ввод чисел для клеток - в пределах с 1 до 8 включительно\033[0m')
# ---------------------------------------------------------------------------------------------------------------------
# # # 2.8 (ход короля)
# stolb_1 = int(input()) in range(1, 9)
# stroka_1 = int(input()) in range(1, 9)
# stolb_2 = int(input()) in range(1, 9)
# stroka_2 = int(input()) in range(1, 9)
# if stolb_2 == stolb_1 + 1 or stolb_2 == stolb_1 - 1 and stroka_2 == stroka_1 + 1 or stroka_2 == stroka_1 - 1:
#     print('\033[32m\033[4mYes\033[0m')
# else:
#     print('\033[31m\033[4mNo\033[0m')
