# ********************************************************************************************************************
#                                                 ord(СИМВОЛ)
# ********************************************************************************************************************
# ord(СИМВОЛ) - функция возвращает числовой код символа в двоичной системе. Только 1 символ!

# simvol = ord('f')
# print(simvol)  # => 102


# ********************************************************************************************************************
#                                               chr(КОД_СИМВОЛА)
# ********************************************************************************************************************
# chr(КОД_СИМВОЛА) - возвращает символ по коду, указанному в скобках

# code = chr(102)
# print(code)  # => f

# --------------------------------------------------------------------------------------------------------------------

# start = ord('A')
# end = ord('Z')
# for i in range(start, end + 1):
#     print(f'{chr(i)} = {i}  ', end='')
#     if (i + 1) % 5 == 0:
#         print()

# ********************************************************************************************************************
#                               Slice строки - выглядят как СТРОКА[start:end:step]
# ********************************************************************************************************************

# s = 'Срезы отлично применяются к строкам.'
# print(f's = "{s}"')
# print(f'1. s[0:5] = {s[0:5]}')
# print(f'1. s[0:10:2] = {s[0:10:2]}')
# print(f'1. s[-10:-1] = {s[-10:-1]}')
# print(f'1. s[::-1] = {s[::-1]}')
# print(f'1. s[-8:] = {s[-8:]}')

stroka_01 = 'Сreate'
stroka_02 = 'Create'
list_of_stroka_01 = list(stroka_01)
list_of_stroka_02 = list(stroka_02)

for i in range(len(list_of_stroka_01)):
	print(f'letter {list_of_stroka_01[i]} -> code {ord(list_of_stroka_01[i])}')

print('*' * 60)

for i in range(len(list_of_stroka_02)):
	print(f'letter {list_of_stroka_02[i]} -> code {ord(list_of_stroka_02[i])}')
